{"keras_version": "2.1.5", "config": [{"config": {"padding": "same", "bias_regularizer": null, "batch_input_shape": [null, 32112, 20, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [3, 3], "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "kernel_constraint": null, "kernel_size": [25, 5], "dtype": "float32", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "bias_regularizer": null, "batch_input_shape": [null, 32112, 20, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 3], "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "kernel_constraint": null, "kernel_size": [10, 3], "dtype": "float32", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 1], "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 1024, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "units": 2, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "softmax", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}